dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxSrc_reg.h
/** \brief 1B0, HSSL0 Channel 2 OK Service Request */
#define SRC_HSSL_HSSL0_CH2_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_COK.
*/
#define SRC_HSSL0COK2 (SRC_HSSL_HSSL0_CH2_COK)

/** \brief 1B4, HSSL0 Channel 2 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH2_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_RDI.
*/
#define SRC_HSSL0RDI2 (SRC_HSSL_HSSL0_CH2_RDI)

/** \brief 1B8, HSSL0 Channel 2 Error Service Request */
#define SRC_HSSL_HSSL0_CH2_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_ERR.
*/
#define SRC_HSSL0ERR2 (SRC_HSSL_HSSL0_CH2_ERR)

/** \brief 1BC, HSSL0 Channel 2 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH2_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381BCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_TRG.
*/
#define SRC_HSSL0TRG2 (SRC_HSSL_HSSL0_CH2_TRG)

/** \brief 1C0, HSSL0 Channel 3 OK Service Request */
#define SRC_HSSL_HSSL0_CH3_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_COK.
*/
#define SRC_HSSL0COK3 (SRC_HSSL_HSSL0_CH3_COK)

/** \brief 1C4, HSSL0 Channel 3 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH3_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_RDI.
*/
#define SRC_HSSL0RDI3 (SRC_HSSL_HSSL0_CH3_RDI)

/** \brief 1C8, HSSL0 Channel 3 Error Service Request */
#define SRC_HSSL_HSSL0_CH3_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_ERR.
*/
#define SRC_HSSL0ERR3 (SRC_HSSL_HSSL0_CH3_ERR)

/** \brief 1CC, HSSL0 Channel 3 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH3_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381CCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_TRG.
*/
#define SRC_HSSL0TRG3 (SRC_HSSL_HSSL0_CH3_TRG)

/** \brief 1D0, HSSL0 Exception Service Request */
#define SRC_HSSL_HSSL0_EXI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_EXI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_EXI.
*/
#define SRC_HSSL0EXI (SRC_HSSL_HSSL0_EXI)

/** \brief 1D4, GETH1 Service Request 0 */
#define SRC_GETH1_GETH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D4u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR0.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR0.
*/
#define SRC_GETH10 (SRC_GETH1_GETH0_SR0)

/** \brief 1D8, GETH1 Service Request 1 */
#define SRC_GETH1_GETH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D8u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR1.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR1.
*/
#define SRC_GETH11 (SRC_GETH1_GETH0_SR1)

/** \brief 1DC, GETH1 Service Request 2 */
#define SRC_GETH1_GETH0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381DCu)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR2.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR2.
*/
#define SRC_GETH12 (SRC_GETH1_GETH0_SR2)

/** \brief 1E0, GETH1 Service Request 3 */
#define SRC_GETH1_GETH0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E0u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR3.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR3.
*/
#define SRC_GETH13 (SRC_GETH1_GETH0_SR3)

/** \brief 1E4, GETH1 Service Request 4 */
#define SRC_GETH1_GETH0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E4u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR4.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR4.
*/
#define SRC_GETH14 (SRC_GETH1_GETH0_SR4)

/** \brief 1E8, GETH1 Service Request 5 */
#define SRC_GETH1_GETH0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E8u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR5.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR5.
*/
#define SRC_GETH15 (SRC_GETH1_GETH0_SR5)

/** \brief 1EC, GETH1 Service Request 6 */
#define SRC_GETH1_GETH0_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ECu)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR6.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR6.
*/
#define SRC_GETH16 (SRC_GETH1_GETH0_SR6)

/** \brief 1F0, GETH1 Service Request 7 */
#define SRC_GETH1_GETH0_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F0u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR7.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR7.
*/
#define SRC_GETH17 (SRC_GETH1_GETH0_SR7)

/** \brief 1F4, GETH1 Service Request 8 */
#define SRC_GETH1_GETH0_SR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F4u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR8.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR8.
*/
#define SRC_GETH18 (SRC_GETH1_GETH0_SR8)

/** \brief 1F8, GETH1 Service Request 9 */
#define SRC_GETH1_GETH0_SR9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F8u)
/** Alias (User Manual Name) for SRC_GETH1_GETH0_SR9.
* To use register names with standard convension, please use SRC_GETH1_GETH0_SR9.
*/
#define SRC_GETH19 (SRC_GETH1_GETH0_SR9)

/** \brief 220, I2C0 Data Transfer Request */
#define SRC_I2C_I2C0_DTR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038220u)
/** Alias (User Manual Name) for SRC_I2C_I2C0_DTR.
* To use register names with standard convension, please use SRC_I2C_I2C0_DTR.
*/
#define SRC_I2C0DTR (SRC_I2C_I2C0_DTR)

/** \brief 224, I2C0 Error Service Request */
#define SRC_I2C_I2C0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038224u)
/** Alias (User Manual Name) for SRC_I2C_I2C0_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C0_ERR.
*/
#define SRC_I2C0ERR (SRC_I2C_I2C0_ERR)

